import type { Pizza } from 'entities/PizzaCard/lib/types/pizza'

export const PIZZAS: Pizza[] = [
    {
        id: '1',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '2',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '3',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '4',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '5',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '6',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '7',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    },
    {
        id: '8',
        title: 'Охотничья',
        types: [0, 1],
        sizes: [0, 1, 2],
        category: 4,
        rating: 4,
        description:
            'Двойная порция классических колбасок, красный лук, томаты, соус барбекю, моцарелла, фирменный томатный соус',
        imgSrc: 'https://media.dodostatic.net/image/r:292x292/019635b27c727302835040e5d7c27caa.jpg',
        price: {
            '0': {
                '0': 300,
                '1': 400,
                '2': 500
            },
            '1': {
                '0': 350,
                '1': 450,
                '2': 550
            }
        },
        weight: {
            '0': {
                '0': 380,
                '1': 410,
                '2': 640
            },
            '1': {
                '0': 430,
                '1': 690,
                '2': 790
            }
        }
    }
]
